tests/load/backend.yaml
config:
  target: "https://elu5r5xboeui4hdy2dovhttnmm0nvndr.lambda-url.eu-central-1.on.aws/"
  http:
    timeout: 30
  phases:
    - duration: 60
      arrivalRate: 2
  plugins:
    expect: {}

scenarios:
  - name: "Ask question (upload only in pro)"
    flow:
      - post:
          url: /ask
          headers:
            Authorization: "Bearer dummy"
          json:
            context: "dummy context"
            question: "this is a load test"
            email: "load@test"
          expect:
            - statusCode: 200

# Using in .github workflow:
# https://www.artillery.io/docs/guides/integration-guides/github-actions

# Running tests from lambda
# https://www.artillery.io/docs/guides/guides/distributed-load-tests-on-aws-lambda

#  Load-Test:
#    runs-on: ubuntu-latest
#
#    steps:
#      - name: Checkout repository
#        uses: actions/checkout@v2
#
#      - name: Setup node
#        uses: actions/setup-node@v3
#        with:
#          node-version: 16
#
#      - name: Setup python
#        uses: actions/setup-python@v4
#        with:
#          python-version: '3.9'
#          cache: 'pip'
#
#      - name: Execute load tests
#        run: |
#          npm install -g artillery@latest
#          npm install -g artillery artillery-engine-playwright
#          artillery run tests/load/fullstack.yaml
#
#      - name: Cleanup
#        run:  |
#          cd tests/load
#          pip install -r requirements.txt
#          python cleanup_sandbox.pyn
#